Repository: kodi-game/game.libretro.ep128emu
Catalog: game.libretro.ep128emu/resources/language/resource.language.*/strings.po
Languages: es_es, ga, zh_cn

# Addon Description
source: ep128emu is a portable emulator of the Enterprise 64/128, ZX Spectrum 48/128, and Amstrad CPC 464/664/6128 computers.
es_es: ep128emu es un emulador portátil de los ordenadores Enterprise 64/128, ZX Spectrum 48/128 y Amstrad CPC 464/664/6128.
ga: Is aithriseoir iniompartha é ep128emu do na ríomhairí Enterprise 64/128, ZX Spectrum 48/128, agus Amstrad CPC 464/664/6128.
zh_cn: ep128emu 是 Enterprise 64/128、ZX Spectrum 48/128 和 Amstrad CPC 464/664/6128 计算机的便携式模拟器。

# #30001
source: Main thread wait (ms)
es_es: Espera del Hilo Principal (ms)
ga: Fanacht an phríomhshnáithe (ms)
zh_cn: 主线程等待时间（毫秒）

# #30002
source: High sound quality
es_es: Sonido de Alta Calidad
ga: Ardchaighdeán fuaime
zh_cn: 高音质

# #30003
source: Use accelerated SW framebuffer
es_es: Utilizar SW Framebuffer Acelerado
ga: Úsáid maolán fráma SW luathaithe
zh_cn: 使用加速软件帧缓冲区

# #30004
source: Enable resolution changes (requires restart)
es_es: Activar Cambios de Resolución (requiere reinicio)
ga: Cumasaigh athruithe réitigh (tá atosú ag teastáil)
zh_cn: 启用分辨率更改（需要重新启动）

# #30005
source: Border lines to keep when zooming in
es_es: Líneas de Borde a Mantener al Acercar
ga: Línte teorann le coinneáil agus tú ag zúmáil isteach
zh_cn: 放大时要保留的边框线

# #30006
source: System ROM version (Enterprise only)
es_es: Versión ROM del Sistema (sólo enterprise)
ga: Leagan ROM an chórais (Fiontar amháin)
zh_cn: 系统 ROM 版本（仅限企业版）

# #30007
source: Player 1 Zoom button
es_es: Jugador 1 Botón de Zoom
ga: Cnaipe súmála Imreoir 1
zh_cn: 玩家1缩放按钮

# #30008
source: Player 1 Info button
es_es: Jugador 1 Botón de Info
ga: Cnaipe Eolais Imreoir 1
zh_cn: 玩家1信息按钮

# #30009
source: Player 1 Autofire for button
es_es: Jugador 1 Botón de Disparo Automático
ga: Imreoir 1 Uath-lámhaigh don chnaipe
zh_cn: 玩家1按钮自动开火

# #30010
source: Player 1 Autofire repeat delay
es_es: Jugador 1 Retardo en la Repetición del Disparo Automático
ga: Moill athrá uathoibríoch tine Imreoir 1
zh_cn: 玩家1自动开火延迟
